In [1]:
import pandas as pd
from pandas import Series, DataFrame

In [2]:
obj = pd.Series([4, 7, -5, 3])
# the numbers in brackets are all included in the same column
# index is generated for each starting from 0

In [3]:
obj
# out displays the index in the left column and the numbers in the array in the right one

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
obj.values
# displays values included in the array

array([ 4,  7, -5,  3])

In [5]:
obj.index
# description of default indexing
# starting at 0, ending at 4 -- 0, 1, 2, 3 are displayed

RangeIndex(start=0, stop=4, step=1)

In [6]:
obj2 = pd.Series([4, 7, -5, 3], index = ['d', 'b', 'a', 'c'])
# indexing in order, d, 4 - b, 7 etc

In [7]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [8]:
obj2.index
# we also get info on the dtype (Type of data: integer, float, Python object etc.)

Index(['d', 'b', 'a', 'c'], dtype='object')

In [9]:
obj2['a']

-5

In [10]:
obj2['d']

4

In [11]:
obj2['d'] = 6

In [12]:
obj2[['c', 'a', 'd']]
# this is interpreted as indices

c    3
a   -5
d    6
dtype: int64

In [13]:
obj2[obj2 > 0]
# displays int bigger than 0

d    6
b    7
c    3
dtype: int64

In [14]:
obj2 * 2
# multiplies each number in the array with 2

d    12
b    14
a   -10
c     6
dtype: int64

In [15]:
import numpy as np

In [16]:
np.exp(obj2)
# 2.718281, Euler's number is exp
# calc this separately!

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [17]:
'b' in obj2

True

In [18]:
'e' in obj2

False

In [19]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [20]:
obj3 = pd.Series(sdata)
# displays columns and rows, in left column the key and on the right the value

In [21]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [22]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [23]:
obj4 = pd.Series(sdata, index=states)
# assign order for indexing. if the index is not existing, response NaN

In [24]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [25]:
pd.isnull(obj4)
# bool to test which have no values

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [26]:
pd.notnull(obj4)
# bool to check which have values

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [27]:
obj4.isnull()
# this have the same outcome as pd.isnull(obj4)
# either obj used instead of pd or as argument

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [28]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [29]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [30]:
obj3 + obj4
# if int and float are combined the dtype will be float

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [31]:
obj4.name = 'population'
# display at the bottom next to data type

In [32]:
obj4.index.name = 'state'
# displays at the top left

In [33]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [34]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [35]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [36]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [37]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
       'year': [2000, 2001, 2002, 2001, 2002, 2003],
       'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
# these each have their own column, with key name and list values below

In [38]:
frame = pd.DataFrame(data)

In [39]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [40]:
frame.head()
# displays the first five rows

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [41]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
            index=['one', 'two', 'three', 'four', 'five', 'six'])
# defining index/rows and categories/columns

In [42]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [43]:
frame2.columns
# displays categories/keys for columns and dtype

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [44]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [45]:
frame2['year']

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [46]:
frame2.loc['three']
# displays all keys and values for index 'three'
# loc is locator attribute

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [47]:
frame2['debt'] = 16.5

In [48]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [49]:
frame2['debt'] = np.arange(6.)
# np.arange will use numbers 0-5 for the column 'debt'

In [50]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [51]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [52]:
frame2['debt'] = val

In [53]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [54]:
frame2['eastern'] = frame2.state == 'Ohio'
# creates a new column called 'easterns'

In [55]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [56]:
del frame2['eastern']

In [57]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [58]:
pop = {'Nevada': {2001: 2.4, 2002:2.9},
      'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
# outer keys are interpreted as columns
# NaN value will be displayed at the end

In [59]:
frame3 = pd.DataFrame(pop)

In [60]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [61]:
frame3.T
# swapping the rows with the columns

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [62]:
pd.DataFrame(pop, index=[2001, 2002, 2003])
# rows are indexes and defined to be the years

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [63]:
pdata = {'Ohio': frame3['Ohio'][:-1],
    'Nevada': frame3['Nevada'][:2]}
# this way is deprecated. we should use series.loc[i:j]

/tmp/ipykernel_5267/3195126122.py:1: FutureWarning: The behavior of `series[i:j]` with an integer-dtype index is deprecated. In a future version, this will be treated as *label-based* indexing, consistent with e.g. `series[i]` lookups. To retain the old behavior, use `series.iloc[i:j]`. To get the future behavior, use `series.loc[i:j]`.
  pdata = {'Ohio': frame3['Ohio'][:-1],
/tmp/ipykernel_5267/3195126122.py:2: FutureWarning: The behavior of `series[i:j]` with an integer-dtype index is deprecated. In a future version, this will be treated as *label-based* indexing, consistent with e.g. `series[i]` lookups. To retain the old behavior, use `series.iloc[i:j]`. To get the future behavior, use `series.loc[i:j]`.
  'Nevada': frame3['Nevada'][:2]}

In [64]:
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [65]:
frame3.index.name = 'year'; frame3.columns.name = 'state'

In [66]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [67]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [68]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

In [69]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])

In [70]:
index = obj.index

In [71]:
index

Index(['a', 'b', 'c'], dtype='object')

In [72]:
index[1:]

Index(['b', 'c'], dtype='object')

In [73]:
index[1] = 'd'
# typ error. Index objects are immutable/can't be modified

TypeError: Index does not support mutable operations

In [ ]:
labels = pd.Index(np.arange(3))

In [ ]:
labels

In [ ]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)

In [ ]:
obj2

In [ ]:
obj2.index is labels

In [ ]:
frame3

In [ ]:
frame3.columns

In [ ]:
'Ohio' in frame3.columns

In [ ]:
2003 in frame3.index

In [ ]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])

In [ ]:
dup_labels

In [ ]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [ ]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [ ]:
obj2

In [ ]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [ ]:
obj3

In [74]:
obj3.reindex(range(6), method='ffill')
# filling value in range six. blue, purple and yellow will all appear twice.

ValueError: index must be monotonic increasing or decreasing

In [ ]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)), 
index=['a', 'c', 'd'],
columns=['Ohio', 'Texas', 'California'])
# nine values, shaped in three rows and three columns

In [ ]:
frame

In [ ]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

In [ ]:
frame2
# with reindexing another index was added that contain no value, hence NaN

In [ ]:
states = ['Texas', 'Utah', 'California']

In [ ]:
frame.reindex(columns=states)

In [ ]:
frame.loc[['a', 'b', 'c', 'd'], states]
# returns - 'b' is not an index

In [ ]:
obj = pd.Series(np.arange(5), index=['a', 'b', 'c', 'd', 'e'])

In [ ]:
new_obj = obj.drop('c')
# removing 'c' row

In [ ]:
new_obj

In [ ]:
obj.drop(['d', 'c'])
# drop removes the defined indexes
# important with [] when more than one

In [ ]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    # arranging number 0-15 in four rows and four columns
index = ['Ohio', 'Colorado', 'Utah', 'New york'],
columns = ['one', 'two', 'three', 'four'])

In [ ]:
data

In [ ]:
data.drop(['Colorado', 'Ohio'])
# the whole rows and values are removed

In [ ]:
data.drop('two', axis=1)
# removed the column two and all values

In [ ]:
data.drop(['two', 'four'], axis='columns')
# removes two and four columns with all values

In [ ]:
obj.drop('c', inplace=True)
# manipulate object without returning a new object
# inplace destroys and data that is dropped

In [ ]:
obj

In [ ]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
# when a number with dot - 4. is used it defines that the number is a float

In [ ]:
obj

In [ ]:
obj['b']
# using list indexing to get the value

In [75]:
obj[1]
# this and obj['b'] will reach the same result as obj['b'] in this case
# it refers to index 1

1

In [76]:
obj[2:4]
# displays position 2 and 3 with values

c    2
dtype: int64

In [77]:
obj[['b', 'a', 'd']]

KeyError: "['d'] not in index"

In [ ]:
obj[[1, 3]]
# returns index name and value for index 1 and 3

In [ ]:
obj[obj<2]
# returns index name and value for all objects with value that is less than 2

In [ ]:
obj['b':'c']
# return values for index 'b' and 'c'

In [ ]:
obj['b':'c'] = 5
# changing value for 'b' and 'c' to 5

In [ ]:
obj

In [78]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index = ['Ohio', 'Colorado', 'Utah', 'New york'],
                   columns = ['one', 'two', 'three', 'four'])

In [79]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New york   12   13     14    15

In [80]:
data['two']
# returns all values in column 'two'

Ohio         1
Colorado     5
Utah         9
New york    13
Name: two, dtype: int64

In [81]:
data[['three', 'one']]
# returns all values in columns'three and 'one', in the defined order 'three' first and then 'one'

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New york     14   12

In [82]:
data[:2]
# slices the rows, returning all columns and the two first rows with values (index 0 and 1)

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [83]:
data[data['three'] > 5]
# need more context

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New york   12   13     14    15

In [84]:
data < 5
# bool comparison
# is the data in data smaller than 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New york  False  False  False  False

In [85]:
data[data < 5] = 0
# all values that are smaller than 5 equals 0

In [86]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New york   12   13     14    15

In [87]:
data.loc['Colorado', ['two', 'three']]
# returns 'Colorado' value for columns 'two' and 'three'

two      5
three    6
Name: Colorado, dtype: int64

In [88]:
data.iloc[2, [3, 0, 1]]
# '2' is index rows which is 'Utah'
# '3', '0', '1' is the index number is the value and the order in which they will be returned
# the column names will return as index name in this case ie. 'four' 11, 'one' 8, 'two' 9

four    11
one      8
two      9
Name: Utah, dtype: int64

In [89]:
data.iloc[2]
# if only the index row is specified then index will return as 'name' at the bottom  left
# column name will return as index names for rows
# the values will be returned in order specified in the variable 'data' ('one', 'two', 'three', 'four')

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [90]:
data.iloc[[1, 2], [3, 0, 1]]
# [1, 2] is index position for row index
# [3, 0, 1] is the index position for the columns and also the order in which they will be returned

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [91]:
data.loc[:'Utah', 'two']
# row index names will be returned until 'Utah'
# the values return are included in column 'two'

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [92]:
data.iloc[:, :3][data.three > 5]
# [:, :3] is returning the three first columns
# [data.three > 5] returns the three first rows with values bigger than 5

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New york   12   13     14

In [93]:
ser = pd.Series(np.arange(3.))
# arranging three number starting from 0 using float

In [94]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [95]:
ser[-1]
# this doesn't work

KeyError: -1

In [ ]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])

In [ ]:
ser2[-1]
# when we specify the index we can call for the last item with -1

In [ ]:
ser.iloc[-1]
# if we instead of just calling for the last index in as list use iloc, the value will be returned

In [96]:
ser[:2]
# slicing until index two

0    0.0
1    1.0
dtype: float64

In [97]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a','c', 'd', 'e'])

In [98]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a','c', 'e', 'f', 'g'])

In [99]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [100]:
s1+s2
# Nan is because only one of them have the index 'd', 'f', 'g' with value

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [101]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bde'), 
                   index=['Ohio', 'Texas', 'Colorado'])

In [102]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [103]:
df1

            b    d    e
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [104]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [105]:
df1+df2
# same here as above. The values cannot me merged if only one of the frames have index and value

            b     d     e
Colorado  NaN   NaN   NaN
Ohio      3.0   5.0   7.0
Oregon    NaN   NaN   NaN
Texas     9.0  11.0  13.0
Utah      NaN   NaN   NaN

In [106]:
df1 = pd.DataFrame({'A':[1, 2]})
# one column, two rows. The name of the column is 'A', the values is 1 and 2 (index will generate as 0 and 1)

In [107]:
df2 = pd.DataFrame({'B':[3, 4]})

In [108]:
df1

   A
0  1
1  2

In [109]:
df2

   B
0  3
1  4

In [110]:
df1-df2

    A   B
0 NaN NaN
1 NaN NaN

In [111]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
# arranging number 0-11 in three rows and four columns with column names, 'a', 'b', 'c', 'd'

In [112]:
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))

In [113]:
df2.loc[1, 'b'] = np.nan
# defining index position 0, column 'b' to be NaN

In [114]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [115]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [116]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [117]:
df1.add(df2, fill_value=0)
# add() adds the number id df1 with the number in the same position in df2

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [118]:
1/df1
# one divided by each number in df1. result displayed in same same position as previously

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [119]:
df1.rdiv(1)
# this is the same as 1/df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [120]:
df1.reindex(columns=df2.columns, fill_value=0)
# df1 have four columns. when reindexing adding a columns from df2 'e' and filling it with the value 0

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [121]:
arr = np.arange(12.).reshape((3, 4))

In [122]:
arr[0]
# returns the first row out of three, index 0

array([0., 1., 2., 3.])

In [123]:
arr - arr[0]
# every number in every row in arr minus the number in the same column in the first row arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [124]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                    columns=list('bde'),
                    index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [125]:
series = frame.iloc[0]
# this points to row one (index 0). The column names becomes the name of the rows
# and the values all become values in the same column
# this is for the index that is pointed to, in this case 'Utah'

In [126]:
frame
# as defined in variable 'frame' - there are three columns: 'b', 'd', 'e' and four rows with the given names
# the values are 0-11

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [127]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [128]:
frame - series  
# the numbers in the first columns minus the number in the first row in series (whih is 0)
# the second column minus the second row (which is 1)
# and the numbers in the third column minus the number in the third row in series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [129]:
series2 = pd.Series(range(3), index=['b', 'e', 'f' ])
# the values in series 2 is 0, 1 and 2

In [130]:
frame + series2
# each number in column b will be added with number 0
# the next column 'e' - each number will be added with 1
# d is not existing for series 2 and cannot be merged
# f will again not be possible as it is not existing for frame and returns NaN

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [131]:
series3 = frame['d']
# return the values in column 'd'

In [132]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [133]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [134]:
frame.sub(series3, axis='index')
# sub() is subtraction frame - series3
# series3 is 1, 4, 7, 10
# we take each value in series and subtract this value from the value in each value in the column in frame
# ie. 0-1, 3-4, 6-7, 9-10 in the fist column

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [135]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                    index=['Utah', 'Ohio', 'Texas', 'Oregon'])
#  random randn generates normally distributed numbers from a normal distribution 
# that has a mean of 0 and a standard deviation of 1.

In [136]:
frame

               b         d         e
Utah   -0.669663 -0.025352 -0.676244
Ohio    2.650681 -0.993212 -0.661897
Texas   0.954990  0.331280  1.542738
Oregon -0.471125 -0.299056  0.864434

In [137]:
np.abs(frame)
# abs calculates the absolute value

               b         d         e
Utah    0.669663  0.025352  0.676244
Ohio    2.650681  0.993212  0.661897
Texas   0.954990  0.331280  1.542738
Oregon  0.471125  0.299056  0.864434

In [138]:
f = lambda x: x.max() - x.min()
# in this case it would be better to define the function f more explicitly:
# def f(x):
#    return x.max() - x.min()

In [139]:
frame.apply(f)

b    3.320345
d    1.324493
e    2.218982
dtype: float64

In [140]:
frame.apply(f, axis='columns')

Utah      0.650892
Ohio      3.643894
Texas     1.211458
Oregon    1.335559
dtype: float64

In [141]:
fr1 = pd.DataFrame(np.arange(9).reshape((3,3)), columns=list('abc'))

In [142]:
fr1

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [143]:
fr1.apply(f)

a    6
b    6
c    6
dtype: int64

In [144]:
fr1.apply(f, axis="columns")

0    2
1    2
2    2
dtype: int64

In [145]:
fr1

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [146]:
fr1.T

   0  1  2
a  0  3  6
b  1  4  7
c  2  5  8

In [147]:
foo=[1,2,3,4,5,6]; evens=list(filter(lambda x:(x%2==0), foo))

In [148]:
foo

[1, 2, 3, 4, 5, 6]

In [149]:
evens

[2, 4, 6]

In [150]:
frame.apply(f, axis='columns')
# when defining axis = max number - min number on rows onstead of columns
# the state names remain indexes and the result is displayed in the second column

Utah      0.650892
Ohio      3.643894
Texas     1.211458
Oregon    1.335559
dtype: float64

In [151]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])
# the column names is as defined in frame
# index is defined as 'min' and 'max'
# return the lowest and the highest numbers

In [152]:
frame.apply(f)

            b         d         e
min -0.669663 -0.993212 -0.676244
max  2.650681  0.331280  1.542738

In [153]:
format = lambda x: '%.2f' % x
# the float will have two decimal numbers

In [154]:
frame.applymap(format)

            b      d      e
Utah    -0.67  -0.03  -0.68
Ohio     2.65  -0.99  -0.66
Texas    0.95   0.33   1.54
Oregon  -0.47  -0.30   0.86

In [155]:
frame['e'].map(format)
# returns the values in column 'e'
# format still applied, so two decimal numbers

Utah      -0.68
Ohio      -0.66
Texas      1.54
Oregon     0.86
Name: e, dtype: object

In [156]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])

In [157]:
obj.sort_index()
# returns new sorted object

a    1
b    2
c    3
d    0
dtype: int64

In [158]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                    index=['three', 'one'],
                    columns=['d', 'a', 'b', 'c'])

In [159]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [160]:
frame.sort_index()
# sorts index (rows)

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [161]:
frame.sort_index(axis=1)
# axis 1 is columns
# it sorts the column names

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [162]:
frame.sort_index(axis=1, ascending=False)
# goes from d, c, b, a in column order
# id ascending=True it goes a, b, c, d

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [163]:
obj = pd.Series([4, 7, -3, 2])

In [164]:
obj
# indexes automatically will start from 0 and fill up as needed, in this case to 3 wt corrwsponding value

0    4
1    7
2   -3
3    2
dtype: int64

In [165]:
obj.sort_values()
# sort_values() starts with the lowest value and corresponding index

2   -3
3    2
0    4
1    7
dtype: int64

In [166]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])

In [167]:
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [168]:
obj.sort_values()
# lowest to higest and nan will be returned at the end

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [169]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [170]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [171]:
frame.sort_values(by='b')
# column 'b' is setting order of return
# lowest to highest for 'b' and 'a'

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [172]:
frame.sort_values(by=['a', 'b'])
# 'a' takes precendece, lowest to highest
# 'b' follows even if the pattern is not followed

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [173]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])

In [174]:
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [175]:
obj.rank()
# start ranking the lowest number as 1.0 and continues to the highest
# for entrieds 0 to 2 average rank is used which is x.5

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [176]:
obj.rank(method='first')
# rank assigned in the order they are observed
# precise ranking is used bcs label 0 precedes label 2 in data

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [177]:
obj.rank(ascending=False, method='max')
# ranking in decending order

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [178]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1], 'c': [-2, 5, 8, -2.5]})

In [179]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [180]:
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [181]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

In [182]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [183]:
obj.index.is_unique

False

In [184]:
obj['a']

a    0
a    1
dtype: int64

In [185]:
obj['c']

4

In [186]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])

In [187]:
df

          0         1         2
a -0.427285 -1.014518  1.429582
a  0.655409  0.725229  0.062737
b -1.411022  0.595536  0.269556
b  0.527609 -0.367847 -0.403141

In [188]:
df.loc['b']

          0         1         2
b -1.411022  0.595536  0.269556
b  0.527609 -0.367847 -0.403141

In [189]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                  [np.nan, np.nan], [0.75, -1.3]],
                 index=['a', 'b', 'c', 'd'],
                 columns=['one', 'two'])

In [190]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [191]:
df.sum()
# summarizes all values in column 'one' and column 'two' separately
# the column names becomes index names

one    9.25
two   -5.80
dtype: float64

In [192]:
df.sum(axis='columns')
# summarizes the values in a row
# the default is to summarize columns so this needs definition

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [193]:
df.mean(axis='columns', skipna=False)
# displays the average
# the rows which contains NaN are excluded with skipna

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [194]:
df.idxmax()
# returns index value of the minimum and maximum values

one    b
two    d
dtype: object

In [195]:
df.cumsum()
# accumulation in columns - the first value, the first value plus the second value, 
# the first and second plus the third value and so on

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [196]:
df.describe()
# study more

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [197]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)

In [198]:
obj.describe()
# count: 16 which is the number of values
# unique: 3 is the number of unique values 'a', 'b', 'c'
# frequency is how many 'top' (a) is existing

count     16
unique     3
top        a
freq       8
dtype: object

In [199]:
import pandas_datareader.data as web

In [200]:
all_data = {ticker: web.get_data_yahoo(ticker)
           for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

In [201]:
price = pd.DataFrame({ticker: data['Adj Close']
                     for ticker, data in all_data.items()})

In [202]:
volume = pd.DataFrame({ticker: data['Volume']
                      for ticker, data in all_data.items()})

In [203]:
returns = price.pct_change()
# price changes in percent for 'AAPL', 'IBM' etc

In [205]:
returns.tail()
# tail return the last five rows
# One can also specify the number of rows to be displayed
# n = 12
# bottom = returns.tail(n = n)

                AAPL       IBM      MSFT      GOOG
Date
2022-11-17  0.012971  0.010863 -0.000207 -0.004950
2022-11-18  0.003782  0.010610 -0.001903 -0.007107
2022-11-21 -0.021680 -0.006502  0.003441 -0.020143
2022-11-22  0.014661  0.016499  0.012311  0.015653
2022-11-23  0.005926 -0.002347  0.010407  0.015309

In [207]:
returns['MSFT'].corr(returns['IBM'])
# compares/correlation between MSFT and IBM
# returns percent in decimal form

0.49432966616024226

In [208]:
returns['MSFT'].cov(returns['IBM'])

0.0001659108299578188

In [209]:
returns.MSFT.corr(returns.IBM)
# MSFT Python attribute so the syntax can also be written like this

0.49432966616024226

In [210]:
returns.corr()
# lookinh for correlation between all: AAPL, IBM, MSFT, GOOG

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.457906  0.768290  0.696136
IBM   0.457906  1.000000  0.494330  0.457132
MSFT  0.768290  0.494330  1.000000  0.800814
GOOG  0.696136  0.457132  0.800814  1.000000

In [211]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000438  0.000166  0.000312  0.000285
IBM   0.000166  0.000298  0.000166  0.000155
MSFT  0.000312  0.000166  0.000377  0.000305
GOOG  0.000285  0.000155  0.000305  0.000383